Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Renamed whiteboard messages to announcements.
sv: OmdÃ¶pt whiteboard-meddelanden till tillkÃ¤nnagivanden.

source: Fixed occasional problems with registration mails.
sv: Ã tgÃ¤rdade tillfÃ¤lliga problem med registreringsmejl.

source: Improved LINGUAS update add-on to handle more syntax variants.
sv: FÃ¶rbÃ¤ttrad LINGUAS-uppdateringstillÃ¤gg fÃ¶r att hantera fler syntaxvarianter.

source: Fixed editing monolingual XLIFF source file.
sv: Fast redigering av ensprÃ¥kig XLIFF-kÃ¤llfil.

source: Added support for exact matching in :doc:`/user/search`.
sv: Lagt till stÃ¶d fÃ¶r exakt matchning i :doc:`/user/search`.

source: Extended API to cover screenshots, users, groups, componentlists and extended creating projects.
sv: UtÃ¶kad API fÃ¶r att tÃ¤cka skÃ¤rmdumpar, anvÃ¤ndare, grupper, komponentlistor och utÃ¶kad skapande av projekt.

source: Add support for source upload on bilingual translations.
sv: LÃ¤gg till stÃ¶d fÃ¶r kÃ¤lluppladdning vid tvÃ¥sprÃ¥kiga Ã¶versÃ¤ttningar.

source: Added support for intermediate language from developers.
sv: Lagt till stÃ¶d fÃ¶r mellanliggande sprÃ¥k frÃ¥n utvecklare.

source: Added support for source strings review.
sv: Lagt till stÃ¶d fÃ¶r granskning av kÃ¤llstrÃ¤ngar.

source: Extended download options for platform wide translation memory.
sv: UtÃ¶kade nedladdningsalternativ fÃ¶r plattformsÃ¶vergripande Ã¶versÃ¤ttningsminne.

source: Project goals
sv: ProjektmÃ¥l

source: Web-based continuous localization tool with tight :ref:`vcs` supporting a wide range of :ref:`file formats <formats>`, making it easy for translators to contribute.
sv: Webbaserat verktyg fÃ¶r kontinuerlig lokalisering med tight :ref:`vcs` som stÃ¶der ett brett utbud av :ref:`filformat <formats>`, vilket gÃ¶r det enkelt fÃ¶r Ã¶versÃ¤ttare att bidra.

source: "Weblate" is a portmanteau of the words "web" and "translate".
sv: "Weblate" Ã¤r en sammanslagning av orden "web" och "translate".

source: The landing page is https://weblate.org and there is a cloud-hosted service at https://hosted.weblate.org. The documentation can be read at https://docs.weblate.org.
sv: Landningssidan Ã¤r https://weblate.org och det finns en molnbaserad tjÃ¤nst pÃ¥ https://hosted.weblate.org. Dokumentationen kan lÃ¤sas pÃ¥ https://docs.weblate.org.

source: Project logos
sv: Projektlogotyper

source: The project logos and other graphics are available in https://github.com/WeblateOrg/graphics.
sv: Projektlogotyper och annan grafik finns tillgÃ¤nglig pÃ¥ https://github.com/WeblateOrg/graphics.

source: Leadership
sv: Ledarskap

source: This project is maintained by Michal ÄihaÅ, who can be reached at michal@weblate.org.
sv: Detta projekt underhÃ¥lls av Michal ÄihaÅ, som kan nÃ¥s pÃ¥ michal@weblate.org.

source: Authors
sv: FÃ¶rfattare

source: Weblate was started by Michal ÄihaÅ. Since its inception in 2012, thousands of people have contributed.
sv: Weblate startades av Michal ÄihaÅ. Sedan starten 2012 har tusentals mÃ¤nniskor bidragit.

source: Developing add-ons
sv: Utveckla tillÃ¤gg

source: :ref:`addons` are way to customize localization workflow in Weblate.
sv: :ref:`addons` Ã¤r ett sÃ¤tt att anpassa lokaliseringsarbetsflÃ¶det i Weblate.

source: Base class for Weblate add-ons.
sv: Basklass fÃ¶r Weblate-tillÃ¤gg.

source: Check whether add-on is compatible with given component.
sv: Kontrollera om tillÃ¤gget Ã¤r kompatibelt med den angivna komponenten.

source: Event handler for change event.
sv: HÃ¤ndelsehanterare fÃ¶r Ã¤ndringshÃ¤ndelse.

source: Early filtering of Change actions before triggering change_event callback.
sv: Tidig filtrering av Ã¤ndringsÃ¥tgÃ¤rder innan change_event-Ã¥teranropet utlÃ¶ses.

source: Event handler for component update.
sv: HÃ¤ndelsehanterare fÃ¶r komponentuppdatering.

source: Save configuration.
sv: Spara konfigurationen.

source: Event handler daily.
sv: HÃ¤ndelsehanterare dagligen.

source: Return configuration form for adding new add-on.
sv: Returnera konfigurationsformulÃ¤r fÃ¶r att lÃ¤gga till nytt tillÃ¤gg.

source: Return configuration form for this add-on.
sv: Returnera konfigurationsformulÃ¤ret fÃ¶r detta tillÃ¤gg.

source: Event handler after new translation is added.
sv: HÃ¤ndelsehanterare efter att ny Ã¶versÃ¤ttning har lagts till.

source: Event handler after changes are committed to the repository.
sv: HÃ¤ndelsehanterare efter att Ã¤ndringar har lagts in i arkivet.

source: Event handler after add-on is installed.
sv: HÃ¤ndelsehanterare efter att tillÃ¤gget har installerats.

source: Event handler after repository is pushed upstream.
sv: HÃ¤ndelsehanterare efter att arkivet har skickats uppstrÃ¶ms.

source: Event handler after repository is updated from upstream.
sv: HÃ¤ndelsehanterare efter att arkivet har uppdaterats frÃ¥n uppstrÃ¶ms.

source: HEAD of the repository prior to update, can be blank on initial clone.
sv: HEAD i arkivet fÃ¶re uppdateringen kan vara tom vid den fÃ¶rsta kloningen.

source: Whether the add-on operation should skip pushing changes upstream. Usually you can pass this to underlying methods as ``commit_and_push`` or ``commit_pending``.
sv: Om tillÃ¤ggsfunktionen ska hoppa Ã¶ver att skicka Ã¤ndringar uppstrÃ¶ms. Vanligtvis kan du skicka detta till underliggande metoder som ``commit_and_push`` eller ``commit_pending``.

source: Event handler before changes are committed to the repository.
sv: HÃ¤ndelsehanterare innan Ã¤ndringar Ã¶verfÃ¶rs till arkivet.

source: Event handler before repository is pushed upstream.
sv: HÃ¤ndelsehanterare innan arkivet skickas uppstrÃ¶ms.

source: Event handler before repository is updated from upstream.
sv: HÃ¤ndelsehanterare innan arkivet uppdateras frÃ¥n uppstrÃ¶ms.

source: Save add-on state information.
sv: Spara tillÃ¤ggsinformation.

source: Event handler before new unit is created.
sv: HÃ¤ndelsehanterare innan ny enhet skapas.

source: Weblate user used to track changes by this add-on.
sv: Weblate-anvÃ¤ndare som anvÃ¤nds fÃ¶r att spÃ¥ra Ã¤ndringar med detta tillÃ¤gg.

source: ORM object for an add-on.
sv: ORM-objekt fÃ¶r ett tillÃ¤gg.

source: ORM object for a component.
sv: ORM-objekt fÃ¶r en komponent.

source: ORM object for a translation.
sv: ORM-objekt fÃ¶r en Ã¶versÃ¤ttning.

source: ORM object for a project.
sv: ORM-objekt fÃ¶r ett projekt.

source: ORM object for an unit.
sv: ORM-objekt fÃ¶r en enhet.

source: ORM object for an change.
sv: ORM-objekt fÃ¶r en Ã¤ndring.

source: ORM object for an user.
sv: ORM-objekt fÃ¶r en anvÃ¤ndare.

source: Translation file wrapper.
sv: ÃversÃ¤ttningsfilomslag.

source: Base form for configuring add-ons.
sv: Grundform fÃ¶r konfigurering av tillÃ¤gg.

source: Here is an example add-on:
sv: HÃ¤r Ã¤r ett exempel pÃ¥ ett tillÃ¤gg:

source: Weblate source code
sv: Weblate kÃ¤llkod

source: Weblate is developed on `GitHub <https://github.com/WeblateOrg/weblate>`_. You are welcome to fork the code and open pull requests. Patches in any other form are welcome too.
sv: Weblate utvecklas pÃ¥ `GitHub <https://github.com/WeblateOrg/weblate>`_. Du Ã¤r vÃ¤lkommen att fÃ¶rgrena koden och Ã¶ppna pull-fÃ¶rfrÃ¥gningar. Patchar i andra former Ã¤r ocksÃ¥ vÃ¤lkomna.

source: Check out :ref:`internals` to see how Weblate looks from inside.
sv: Kolla in :ref:`internals` fÃ¶r att se hur Weblate ser ut inifrÃ¥n.

source: License and copyright
sv: Licens och upphovsrÃ¤tt

source: When contributing code, you agree to put your changes and new code under the same license as the repository is already using, unless stated and agreed otherwise.
sv: NÃ¤r du bidrar med kod samtycker du till att dina Ã¤ndringar och din nya kod omfattas av samma licens som den som redan anvÃ¤nds fÃ¶r arkivet, om inte annat anges och Ã¶verenskommits.

source: :doc:`/contributing/license` explains licensing in more details.
sv: :doc:`/contributing/license` fÃ¶rklarar licensiering mer detaljerat.

source: Writing a good patch
sv: Skriva en bra patch

source: Write separate changes
sv: Skriv separata Ã¤ndringar

source: It is annoying when you get a massive patch that is said to fix 11 odd problems, but discussions and opinions do not agree with 10 of them or 9 of them were already fixed differently. Then the person merging this change needs to extract the single interesting patch from somewhere within the massive pile of sources, and that creates a lot of extra work.
sv: Det Ã¤r irriterande nÃ¤r man fÃ¥r en enorm patch som sÃ¤gs fixa 11 udda problem, men diskussioner och Ã¥sikter inte stÃ¤mmer Ã¶verens med 10 av dem eller 9 av dem redan har fixats pÃ¥ ett annat sÃ¤tt. DÃ¥ mÃ¥ste den person som sammanfogar denna Ã¤ndring extrahera den enda intressanta patchen frÃ¥n nÃ¥gonstans i den enorma hÃ¶gen av kÃ¤llor, och det skapar en hel del extra arbete.

source: Preferably, each fix that addresses an issue should be in its own patch/commit with its own description/commit message stating exactly what they correct so that all changes can be selectively applied by the maintainer or other interested parties.
sv: Helst bÃ¶r varje korrigering som Ã¥tgÃ¤rdar ett problem finnas i en egen patch/commit med en egen beskrivning/commit-meddelande som anger exakt vad som korrigeras, sÃ¥ att alla Ã¤ndringar kan tillÃ¤mpas selektivt av underhÃ¥llaren eller andra berÃ¶rda parter.

source: Furthermore, separate changes enable bisecting much better for tracking issues and regression in the future.
sv: Dessutom mÃ¶jliggÃ¶r separata Ã¤ndringar en mycket bÃ¤ttre uppdelning fÃ¶r att spÃ¥ra problem och regressioner i framtiden.

source: Documentation can be a tedious task; however, it is necessary for someone to complete it. It makes things a lot easier if you submit the documentation together with code changes. Please remember to document methods, complex code blocks, or user-visible features.
sv: Dokumentation kan vara ett trÃ¥kigt arbete, men det Ã¤r nÃ¶dvÃ¤ndigt att nÃ¥gon gÃ¶r det. Det underlÃ¤ttar mycket om du skickar in dokumentationen tillsammans med kodÃ¤ndringarna. Kom ihÃ¥g att dokumentera metoder, komplexa kodblock eller funktioner som Ã¤r synliga fÃ¶r anvÃ¤ndaren.

source: Test cases
sv: Testfall

source: The tests allow us to quickly verify that the features are working as they are supposed to. To maintain this situation and improve it, all new features and functions that are added need to be tested in the test suite. Every feature that is added should get at least one valid test case that verifies that it works as documented.
sv: Testerna gÃ¶r det mÃ¶jligt fÃ¶r oss att snabbt verifiera att funktionerna fungerar som de ska. FÃ¶r att upprÃ¤tthÃ¥lla denna situation och fÃ¶rbÃ¤ttra den mÃ¥ste alla nya funktioner som lÃ¤ggs till testas i testpaketet. Varje funktion som lÃ¤ggs till bÃ¶r fÃ¥ minst ett giltigt testfall som verifierar att den fungerar enligt dokumentationen.

source: Git commits should follow `Conventional Commits <https://www.conventionalcommits.org/>`_ specification.
sv: Git-commits ska fÃ¶lja specifikationen `Conventional Commits <https://www.conventionalcommits.org/>`_.

source: Type checking
sv: Typskontroll

source: Any new code should utilize :pep:`484` type hints. We are using :program:`mypy` to check (because it has a Django plugin that makes type checking of Django apps doable).
sv: All ny kod bÃ¶r anvÃ¤nda :pep:`484` typindikationer. Vi anvÃ¤nder :program:`mypy` fÃ¶r att kontrollera (eftersom det har ett Django-plugin som gÃ¶r det mÃ¶jligt att kontrollera typen av Django-appar).

source: The code base is not yet completely covered by type annotations, but some modules are already enforced for type checking in the CI.
sv: Kodbasen Ã¤r Ã¤nnu inte helt tÃ¤ckt av typannoteringar, men vissa moduler Ã¤r redan fÃ¶remÃ¥l fÃ¶r typkontroll i CI.

source: Coding standard and linting the code
sv: Kodningsstandard och linting av koden

source: The code should follow :pep:`8` coding guidelines and should be formatted using :program:`ruff` code formatter.
sv: Koden ska fÃ¶lja :pep:`8` kodningsriktlinjer och ska formateras med hjÃ¤lp av :program:`ruff` kodformaterare.

source: To check the code quality, you can use :program:`ruff`, its configuration is stored in :file:`pyproject.toml`.
sv: FÃ¶r att kontrollera kodkvaliteten kan du anvÃ¤nda :program:`ruff`, vars konfiguration lagras i :file:`pyproject.toml`.

source: The easiest approach to enforce all this is to install `pre-commit`_. The repository contains configuration for it to verify the committed files are sane. After installing it (it is already included in the :file:`pyproject.toml`) turn it on by running ``pre-commit install`` in Weblate checkout. This way all your changes will be automatically checked.
sv: Det enklaste sÃ¤ttet att genomfÃ¶ra allt detta Ã¤r att installera `pre-commit`_. Repositoriet innehÃ¥ller konfiguration fÃ¶r att verifiera att de commitade filerna Ã¤r korrekta. Efter installationen (det ingÃ¥r redan i :file:`pyproject.toml`) aktiverar du det genom att kÃ¶ra ``pre-commit install`` i Weblate checkout. PÃ¥ sÃ¥ sÃ¤tt kommer alla dina Ã¤ndringar att kontrolleras automatiskt.

source: You can also trigger check manually, to check all files run:
sv: Du kan ocksÃ¥ starta kontrollen manuellt. FÃ¶r att kontrollera alla filer kÃ¶r du:

source: Coding securely
sv: SÃ¤ker kodning

source: Any code for Weblate should be written with `Security by Design Principles`_ in mind.
sv: All kod fÃ¶r Weblate bÃ¶r skrivas med `Security by Design Principles`_ i Ã¥tanke.

source: AI guidelines
sv: Riktlinjer fÃ¶r AI

source: When contributing content to the project, you give us permission to use it as-is, and you must make sure you are allowed to distribute it to us. By submitting a change to us, you agree that the changes can and should be adopted by the project and get redistributed under the project license. Authors should be explicitly aware that the burden is on them to ensure no unlicensed code is submitted to the project.
sv: NÃ¤r du bidrar med innehÃ¥ll till projektet ger du oss tillstÃ¥nd att anvÃ¤nda det som det Ã¤r, och du mÃ¥ste se till att du har rÃ¤tt att distribuera det till oss. Genom att skicka in en Ã¤ndring till oss samtycker du till att Ã¤ndringarna kan och bÃ¶r antas av projektet och distribueras vidare under projektlicensen. FÃ¶rfattare bÃ¶r vara uttryckligen medvetna om att det Ã¤r deras ansvar att se till att ingen olicensierad kod skickas in till projektet.

source: This is independent of whether AI is used or not.
sv: Detta Ã¤r oberoende av om AI anvÃ¤nds eller inte.

source: When contributing a pull request, you should, of course, always make sure that the proposal is of good quality and the best effort that follows our guidelines. A basic rule of thumb is that if someone can spot that the contribution was made with the help of AI, you have more work to do.
sv: NÃ¤r du bidrar med en pull-fÃ¶rfrÃ¥gan bÃ¶r du naturligtvis alltid se till att fÃ¶rslaget Ã¤r av god kvalitet och att det bÃ¤sta mÃ¶jliga arbete har lagts ner i enlighet med vÃ¥ra riktlinjer. En grundlÃ¤ggande tumregel Ã¤r att om nÃ¥gon kan se att bidraget har skapats med hjÃ¤lp av AI, har du mer arbete att gÃ¶ra.

source: We can accept code written with the help of AI into the project, but the code must still follow coding standards, be written clearly, be documented, feature test cases, and adhere to all the normal requirements we have.
sv: Vi kan acceptera kod som skrivits med hjÃ¤lp av AI i projektet, men koden mÃ¥ste fortfarande fÃ¶lja kodningsstandarder, vara tydligt skriven, dokumenterad, innehÃ¥lla testfall och uppfylla alla vÃ¥ra normala krav.

source: Code of Conduct
sv: UppfÃ¶randekod

source: Our Pledge
sv: VÃ¥rt lÃ¶fte

source: We pledge to make our community welcoming, safe, and equitable for all.
sv: Vi lovar att gÃ¶ra vÃ¥r gemenskap vÃ¤lkomnande, sÃ¤ker och rÃ¤ttvis fÃ¶r alla.

source: We are committed to fostering an environment that respects and promotes the dignity, rights, and contributions of all individuals, regardless of characteristics including race, ethnicity, caste, color, age, physical characteristics, neurodiversity, disability, sex or gender, gender identity or expression, sexual orientation, language, philosophy or religion, national or social origin, socio-economic position, level of education, or other status. The same privileges of participation are extended to everyone who participates in good faith and in accordance with this Covenant.
sv: Vi Ã¤r fast beslutna att frÃ¤mja en miljÃ¶ som respekterar och frÃ¤mjar alla individers vÃ¤rdighet, rÃ¤ttigheter och bidrag, oavsett egenskaper sÃ¥som ras, etnicitet, kast, hudfÃ¤rg, Ã¥lder, fysiska egenskaper, neurodiversitet, funktionsnedsÃ¤ttning, kÃ¶n eller genus, kÃ¶nsidentitet eller kÃ¶nsuttryck, sexuell lÃ¤ggning, sprÃ¥k, filosofi eller religion, nationellt eller socialt ursprung, socioekonomisk stÃ¤llning, utbildningsnivÃ¥ eller annan status. Samma privilegier att delta gÃ¤ller fÃ¶r alla som deltar i god tro och i enlighet med detta avtal.

source: Encouraged Behaviors
sv: Uppmuntrade beteenden

source: While acknowledging differences in social norms, we all strive to meet our community's expectations for positive behavior. We also understand that our words and actions may be interpreted differently than we intend based on culture, background, or native language.
sv: Vi Ã¤r medvetna om att det finns skillnader i sociala normer, men vi strÃ¤var alla efter att uppfylla vÃ¥rt samhÃ¤lles fÃ¶rvÃ¤ntningar pÃ¥ positivt beteende. Vi fÃ¶rstÃ¥r ocksÃ¥ att vÃ¥ra ord och handlingar kan tolkas pÃ¥ ett annat sÃ¤tt Ã¤n vi avser, beroende pÃ¥ kultur, bakgrund eller modersmÃ¥l.

source: With these considerations in mind, we agree to behave mindfully toward each other and act in ways that center our shared values, including:
sv: Med dessa Ã¶vervÃ¤ganden i Ã¥tanke kommer vi Ã¶verens om att upptrÃ¤da med hÃ¤nsyn mot varandra och agera pÃ¥ ett sÃ¤tt som fokuserar pÃ¥ vÃ¥ra gemensamma vÃ¤rderingar, inklusive:

source: Respecting the **purpose of our community**, our activities, and our ways of gathering.
sv: Respektera **syftet med vÃ¥r gemenskap**, vÃ¥ra aktiviteter och vÃ¥ra sÃ¤tt att samlas.

source: Engaging **kindly and honestly** with others.
sv: Att bemÃ¶ta andra **vÃ¤nligt och Ã¤rligt**.

source: Respecting **different viewpoints** and experiences.
sv: Respektera **olika Ã¥sikter** och erfarenheter.

source: **Taking responsibility** for our actions and contributions.
sv: **Ta ansvar** fÃ¶r vÃ¥ra handlingar och bidrag.

source: Gracefully giving and accepting **constructive feedback**.
sv: Att pÃ¥ ett elegant sÃ¤tt ge och ta emot **konstruktiv feedback**.

source: Committing to **repairing harm** when it occurs.
sv: Ã ta sig att **reparera skador** nÃ¤r de uppstÃ¥r.

source: Behaving in other ways that promote and sustain the **well-being of our community**.
sv: UpptrÃ¤da pÃ¥ andra sÃ¤tt som frÃ¤mjar och upprÃ¤tthÃ¥ller **vÃ¤lbefinnandet i vÃ¥rt samhÃ¤lle**.

source: Restricted Behaviors
sv: BegrÃ¤nsade beteenden

source: We agree to restrict the following behaviors in our community. Instances, threats, and promotion of these behaviors are violations of this Code of Conduct.
sv: Vi samtycker till att begrÃ¤nsa fÃ¶ljande beteenden i vÃ¥r gemenskap. Fall, hot och frÃ¤mjande av dessa beteenden utgÃ¶r brott mot denna uppfÃ¶randekod.

source: **Harassment.** Violating explicitly expressed boundaries or engaging in unnecessary personal attention after any clear request to stop.
sv: **Trakasserier.** Att Ã¶vertrÃ¤da tydligt uttryckta grÃ¤nser eller uppvisa onÃ¶dig personlig uppmÃ¤rksamhet efter att ha fÃ¥tt en tydlig uppmaning att sluta.

source: **Character attacks.** Making insulting, demeaning, or pejorative comments directed at a community member or group of people.
sv: **Personangrepp.** Att gÃ¶ra fÃ¶rolÃ¤mpande, nedvÃ¤rderande eller nedsÃ¤ttande kommentarer riktade mot en medlem i gemenskapen eller en grupp mÃ¤nniskor.

source: **Stereotyping or discrimination.** Characterizing anyoneâs personality or behavior on the basis of immutable identities or traits.
sv: **Stereotyper eller diskriminering.** Att karakterisera nÃ¥gons personlighet eller beteende utifrÃ¥n ofÃ¶rÃ¤nderliga identiteter eller egenskaper.

source: **Sexualization.** Behaving in a way that would generally be considered inappropriately intimate in the context or purpose of the community.
sv: **Sexualisering.** Att upptrÃ¤da pÃ¥ ett sÃ¤tt som generellt skulle anses vara olÃ¤mpligt intimt i sammanhanget eller syftet med gemenskapen.

source: **Violating confidentiality**. Sharing or acting on someone's personal or private information without their permission.
sv: **Brott mot sekretess**. Att dela eller agera pÃ¥ nÃ¥gon annans personliga eller privata information utan dennes tillstÃ¥nd.

source: **Endangerment.** Causing, encouraging, or threatening violence or other harm toward any person or group.
sv: **Fara.** Att orsaka, uppmuntra eller hota med vÃ¥ld eller annan skada mot nÃ¥gon person eller grupp.

source: Behaving in other ways that **threaten the well-being** of our community.
sv: UpptrÃ¤da pÃ¥ andra sÃ¤tt som **hotar vÃ¤lbefinnandet** i vÃ¥rt samhÃ¤lle.

source: Other Restrictions
sv: Ãvriga begrÃ¤nsningar

source: **Misleading identity.** Impersonating someone else for any reason, or pretending to be someone else to evade enforcement actions.
sv: **Vilseledande identitet.** Att av nÃ¥gon anledning utge sig fÃ¶r att vara nÃ¥gon annan eller lÃ¥tsas vara nÃ¥gon annan fÃ¶r att undgÃ¥ verkstÃ¤llighetsÃ¥tgÃ¤rder.

source: **Failing to credit sources.** Not properly crediting the sources of content you contribute.
sv: **UnderlÃ¥tenhet att ange kÃ¤llor.** Att inte korrekt ange kÃ¤llorna till det innehÃ¥ll du bidrar med.

source: **Promotional materials**. Sharing marketing or other commercial content in a way that is outside the norms of the community.
sv: **Reklammaterial**. Delning av marknadsfÃ¶ringsmaterial eller annat kommersiellt innehÃ¥ll pÃ¥ ett sÃ¤tt som strider mot gemenskapens normer.

source: **Irresponsible communication.** Failing to responsibly present content which includes, links or describes any other restricted behaviors.
sv: **Oansvarig kommunikation.** UnderlÃ¥tenhet att pÃ¥ ett ansvarsfullt sÃ¤tt presentera innehÃ¥ll som innehÃ¥ller, lÃ¤nkar till eller beskriver andra begrÃ¤nsade beteenden.

source: Reporting an Issue
sv: Rapportera ett problem

source: Tensions can occur between community members even when they are trying their best to collaborate. Not every conflict represents a code of conduct violation, and this Code of Conduct reinforces encouraged behaviors and norms that can help avoid conflicts and minimize harm.
sv: SpÃ¤nningar kan uppstÃ¥ mellan medlemmar i gemenskapen Ã¤ven nÃ¤r de gÃ¶r sitt bÃ¤sta fÃ¶r att samarbeta. Inte alla konflikter innebÃ¤r ett brott mot uppfÃ¶randekoden, och denna uppfÃ¶randekod fÃ¶rstÃ¤rker uppmuntrade beteenden och normer som kan bidra till att undvika konflikter och minimera skador.

source: When an incident does occur, it is important to report it promptly. To report a possible violation, please reach the Community Moderators at community@weblate.org.
sv: NÃ¤r en incident intrÃ¤ffar Ã¤r det viktigt att rapportera den omedelbart. FÃ¶r att rapportera en mÃ¶jlig Ã¶vertrÃ¤delse, vÃ¤nligen kontakta communitymoderatorerna pÃ¥ community@weblate.org.
